{"_id":{"$oid":"5d2fab908babc940aeaf4322"},"Title":"Spider-Man: Far From Home","Description":"Following the events of Avengers: Endgame (2019), Spider-Man must step up to take on new threats in a world that has changed forever.","Genre":{"Name":"Action","Description":"An action movie is similar to adventure, and the protagonist usually takes a risky turn, which leads to desperate situations (including explosions, fight scenes, daring escapes, etc.)."},"Director":{"Name":"Jon Watts","Bio":"He is a director and producer, known for Cop Car (2015), Spider-Man: Homecoming (2017) and The Onion News Network (2011).","Birth":"1981-06-28","Death":"N/A"},"ImagePath":"spiderman.png","Featured":true}
{"_id":{"$oid":"5d307486e25340d93bbb6b3e"},"Title":"Toy Sory 4 ","Description":"When a new toy called ‘Forky’ joins Woody and the gang, a road trip alongside old and new friends reveals how big the world can be for a toy.","Genre":{"Name":"Animation","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Josh Cooley","Bio":"Josh Cooley is known for his work on Toy Story 4 (2019), Inside Out (2015) and Up(2009).","Birth":"1980-05-23","Death":"N/A"},"ImagePath":"toystory4.png","Featured":true}
{"_id":{"$oid":"5d30761de25340d93bbb6b3f"},"Title":"Yesterday","Description":"A struggling musician realizes he is the only person on Earth who can remember The Beatles after waking up in an alternate timeline where they never existed.","Genre":{"Name":"Comedy","Description":"Comedy is a genre that tells about a series of funny, or comical events, intended to make the audience laugh. It is a very open genre, and thus crosses over with many other genres on a frequent basis."},"Director":{"Name":"Danny Boyle","Bio":"Daniel Francis Boyle is an English director of film and stage, producer, and screenwriter. He is known for his work on films including Shallow Grave, Trainspotting and its 2017 sequel, The Beach, 28 Days Later, Sunshine, Slumdog Millionaire, 127 Hours, and Steve Jobs.","Birth":"1956-10-20","Death":"N/A"},"ImagePath":"yesterday.png","Featured":false}
{"_id":{"$oid":"5d3076cae25340d93bbb6b40"},"Title":"Annabelle Comes Home","Description":"Annabelle Comes Home is a 2019 American supernatural horror film based on the legend of the Annabelle doll. It serves as a sequel to 2014's Annabelle and 2017's Annabelle: Creation, and as the seventh installment in the Conjuring Universe franchise.","Genre":{"Name":"Horror","Description":"Horror is a genre of speculative fiction which is intended to frighten, scare, disgust, or startle its readers by inducing feelings of horror and terror."},"Director":{"Name":"Gary Dauberman","Bio":"Gary Dauberman is an American screenwriter. He is best known for writing The Conjuring Universe spin-off horror films Annabelle, Annabelle: Creation and The Nun, and co-writing the 2017 film adaptation of It, based on the novel of the same name by Stephen King.","Birth":"1975-04-23","Death":"N/A"},"ImagePath":"annabelle.png","Featured":false}
{"_id":{"$oid":"5d3076e9e25340d93bbb6b41"},"Title":"Aladdin","Description":"A kind-hearted street urchin and a power-hungry Grand Vizier vie for a magic lamp that has the power to make their deepest wishes come true.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction set in a fictional universe, often inspired by real world myth and folklore."},"Director":{"Name":"Guy Ritchie","Bio":"After watching Butch Cassidy and the Sundance Kid (1969) as a child, Guy realized that what he wanted to do was make films. He never attended film school, saying that the work of film school graduates was boring and unwatchable. At 15 years old, he dropped out of school and in 1995, got a job as a runner, ultimately starting his film career. He quickly progressed and was directing music promos for bands and commercials by 1995.","Birth":"1968-09-10","Death":"N/A"},"ImagePath":"aladdin.png","Featured":true}
{"_id":{"$oid":"5d307704e25340d93bbb6b42"},"Title":"Midsommar","Description":"A couple travels to Sweden to visit a rural hometowns fabled mid-summer festival. What begins as an idyllic retreat quickly devolves into an increasingly violent and bizarre competition at the hands of a pagan cult.","Genre":{"Name":"Horror","Description":"Horror is a genre of speculative fiction which is intended to frighten, scare, disgust, or startle its readers by inducing feelings of horror and terror."},"Director":{"Name":"Ari Aster","Bio":" 'Ari Aster is a director and writer, known for Hereditary (2018), Midsommar (2019) and The Strange Thing About the Johnsons (2011).","Birth":"1979-04-05","Death":"N/A"},"ImagePath":"midsommar.png","Featured":false}
{"_id":{"$oid":"5d307720e25340d93bbb6b43"},"Title":"The Secret Life of Pets 2","Description":"Continuing the story of Max and his pet friends, following their secret lives after their owners leave them for work or school each day.","Genre":{"Name":"Animation","Description":"Horror is a genre of speculative fiction which is intended to frighten, scare, disgust, or startle its readers by inducing feelings of horror and terror."},"Director":{"Name":"Chris Renaud","Bio":"Director Chris Renaud has established himself as a heavyweight in the world of animation following the phenomenal box office success of recent movies Despicable Me (2010), Dr. Seuss The Lorax (2012) and Despicable Me 2 (2013).","Birth":"1976-09-18","Death":"N/A"},"ImagePath":"secretpets2.png","Featured":false}
{"_id":{"$oid":"5d307741e25340d93bbb6b44"},"Title":"Men In Black: International","Description":"The Men in Black have always protected the Earth from the scum of the universe. In this new adventure, they tackle their biggest threat to date: a mole in the Men in Black organization.","Genre":{"Name":"Action","Description":"An action movie is similar to adventure, and the protagonist usually takes a risky turn, which leads to desperate situations (including explosions, fight scenes, daring escapes, etc.)."},"Director":{"Name":"F. Gary Gray","Bio":"F. Gary Gray was born on July 17, 1969 in New York City, New York, USA as Felix Gary Gray. He is a director and producer, known for Set It Off (1996), The Italian Job (2003) and Verhandlungssache (1998).","Birth":"1969-07-17","Death":"N/A"},"ImagePath":"meninblack.png","Featured":true}
{"_id":{"$oid":"5d30775be25340d93bbb6b45"},"Title":"Avengers: Endgame","Description":"After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse Thanos actions and restore balance to the universe.","Genre":{"Name":"Action","Description":"An action movie is similar to adventure, and the protagonist usually takes a risky turn, which leads to desperate situations (including explosions, fight scenes, daring escapes, etc.)."},"Director":{"Name":"Anthony Russo","Bio":"Anthony Russo was born on February 3, 1970 in Cleveland, Ohio, USA as Anthony J. Russo. He is a producer and director, known for Avengers: Infinity War (2018), Captain America: The Winter Soldier (2014) and Captain America: Civil War (2016).","Birth":"1970-02-03","Death":"N/A"},"ImagePath":"avengers.png","Featured":true}
{"_id":{"$oid":"5d307786e25340d93bbb6b46"},"Title":"Rocketman","Description":"A musical fantasy about the fantastical human story of Elton Johns breakthrough years.","Genre":{"Name":"Biography","Description":"The biography genre covers films that are made about others, typically famous people."},"Director":{"Name":"Dexter Fletcher","Bio":"Dexter Fletcher is an English actor and director best known for Press Gang (1989) - where he played opposite real-life partner (at the time) Julia Sawalha - as well as directing Eddie the Eagle (2015) and Rocketman (2019), and finishing off Bohemian Rhapsody (2018) after Bryan Singer was fired. His career began at the age of 10, with a small role in Bugsy Malone (1976).","Birth":"1966-01-31","Death":"N/A"},"ImagePath":"rocketman.png","Featured":true}
{"_id":{"$oid":"5d3077a3e25340d93bbb6b47"},"Title":"T2 Trainspotting","Description":"After 20 years abroad, Mark Renton returns to Scotland and reunites with his old friends Sick Boy, Spud, and Begbie.","Genre":{"Name":"Drama","Description":"Drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Danny Boyle","Bio":"Daniel Francis Boyle is an English director of film and stage, producer, and screenwriter. He is known for his work on films including Shallow Grave, Trainspotting and its 2017 sequel, The Beach, 28 Days Later, Sunshine, Slumdog Millionaire, 127 Hours, and Steve Jobs.","Birth":"1956-10-20","Death":"N/A"},"ImagePath":"t2trainspotting.png","Featured":false}
